Revit 2027 API
ViewSheetSetting.Revert Method
Revert the current view sheet set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Revert()
Public Sub Revert
public:
void Revert()
member Revert : unit -> unit
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when the current view sheet set is In-Session.
See Also
Reference
ViewSheetSetting Class
Autodesk.Revit.DB Namespace